In [3]:
import pandas as pd

In [4]:
# load in data
school_data_path = "resources/schools_complete.csv"
student_data_path = "resources/students_complete.csv"

# read data as a dataframe
school_df = pd.read_csv(school_data_path)
student_df = pd.read_csv(student_data_path)

In [5]:
# look for missing values: count values in each column
student_df.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [6]:
# look for missing values: sum the count of of null values
student_df.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [7]:
# look for missing values: sum the count of non-null values
student_df.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [8]:
# check data types
school_df.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [9]:
# list of all prefixes and suffixes to remove from names
presuf = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

In [10]:
# replace pre/suffixes with an empty space
for word in presuf:
    student_df["student_name"] = student_df["student_name"].str.replace(word,"")

student_df.head(10)

/var/folders/sl/tgxsvd7x1sgfd5nbn3xfjc4m0000gn/T/ipykernel_96299/1146839763.py:3: FutureWarning: The default value of regex will change from True to False in a future version.
  student_df["student_name"] = student_df["student_name"].str.replace(word,"")

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
5,5,Bryan Miranda,M,9th,Huang High School,94,94
6,6,Sheena Carter,F,11th,Huang High School,82,80
7,7,Nicole Baker,F,12th,Huang High School,96,69
8,8,Michael Roth,M,10th,Huang High School,95,87
9,9,Matthew Greene,M,10th,Huang High School,96,84

In [11]:
# merge dataframes into a single data set
full_df = pd.merge(student_df, school_df, on = "school_name")

In [12]:
full_df.head(10)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
7,7,Nicole Baker,F,12th,Huang High School,96,69,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [13]:
# get the total number of students
student_count = full_df["Student ID"].count()
student_count

39170

In [14]:
# get the number of schools
school_count = len(full_df["school_name"].unique())
school_count

15

In [15]:
# calculate the total budget
total_budget = school_df["budget"].sum()
total_budget

24649428

In [16]:
# calculate the average reading score per student
avg_reading_score = full_df["reading_score"].mean()
avg_reading_score

81.87784018381414

In [17]:
# calculate the average math score per student
avg_math_score = full_df["math_score"].mean()
avg_math_score

78.98537145774827

In [18]:
# identify all the students with passing math and reading scores
passed_math = full_df["math_score"] >= 70
passed_reading = full_df["reading_score"] >= 70

passed_math

0         True
1        False
2        False
3        False
4         True
         ...
39165     True
39166     True
39167     True
39168     True
39169     True
Name: math_score, Length: 39170, dtype: bool

In [19]:
# new dataframe of all students who passed math
passed_math = full_df[full_df["math_score"] >= 70]
passed_math.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [20]:
# new dataframe of all students who passed reading
passed_reading = full_df[full_df["reading_score"] >= 70]
passed_reading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [21]:
# count how many students passed math and reading
passed_math_count = passed_math["student_name"].count()
passed_reading_count = passed_reading["student_name"].count()

print(passed_math_count)
print(passed_reading_count)

29370
33610

In [22]:
# calculate percentages of students who passed math and reading

passed_math_pct = passed_math_count / student_count * 100
passed_reading_pct = passed_reading_count / student_count * 100

print(passed_math_pct)
print(passed_reading_pct)

74.9808526933878
85.80546336482001

In [23]:
# calculate percentage of students who passed both math and reading
passed_both = full_df[(full_df["math_score"] >= 70) & (full_df["reading_score"] >= 70)]

passed_both_count = passed_both["student_name"].count()

passed_both_pct = passed_both_count / student_count * 100
passed_both_pct

65.17232575950983

In [24]:
# new dataframe with summary values
district_df = pd.DataFrame(
    [{"Total Schools" : school_count,
     "Total Students" : student_count,
     "Total Budget" : total_budget,
     "Average Math Score" : avg_math_score,
     "Average Reading Score" : avg_reading_score,
     "% Passing Math" : passed_math_pct,
     "% Passing Reading" : passed_reading_pct,
     "% Overall Passing" : passed_both_pct}])

district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [25]:
# format columns

district_df["Total Students"] = district_df["Total Students"].map("{:,}".format)

district_df["Total Budget"] = district_df["Total Budget"].map("${:,.2f}".format)

district_df["Average Math Score"] = district_df["Average Math Score"].map("{:.1f}".format)

district_df["Average Reading Score"] = district_df["Average Reading Score"].map("{:.1f}".format)

district_df["% Passing Math"] = district_df["% Passing Math"].map("{:.0f}".format)

district_df["% Passing Reading"] = district_df["% Passing Reading"].map("{:.0f}".format)

district_df["% Overall Passing"] = district_df["% Overall Passing"].map("{:.0f}".format)

In [26]:
district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [27]:
# reorder columns
new_column_order = ["Total Schools", "Total Students", "Total Budget","Average Math Score", 
                    "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

district_df = district_df[new_column_order]
district_df

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65

In [28]:
# determine school types to index a new dataframe
school_types = school_df.set_index(["school_name"])["type"]
school_types

school_name
Huang High School        District
Figueroa High School     District
Shelton High School       Charter
Hernandez High School    District
Griffin High School       Charter
Wilson High School        Charter
Cabrera High School       Charter
Bailey High School       District
Holden High School        Charter
Pena High School          Charter
Wright High School        Charter
Rodriguez High School    District
Johnson High School      District
Ford High School         District
Thomas High School        Charter
Name: type, dtype: object

In [29]:
# save school types as a dataframe
types_df = pd.DataFrame(school_types)
types_df

                           type
school_name
Huang High School      District
Figueroa High School   District
Shelton High School     Charter
Hernandez High School  District
Griffin High School     Charter
Wilson High School      Charter
Cabrera High School     Charter
Bailey High School     District
Holden High School      Charter
Pena High School        Charter
Wright High School      Charter
Rodriguez High School  District
Johnson High School    District
Ford High School       District
Thomas High School      Charter

In [30]:
# get total students per school from school dataframe
per_school_counts = school_df.set_index("school_name")["size"]
per_school_counts

school_name
Huang High School        2917
Figueroa High School     2949
Shelton High School      1761
Hernandez High School    4635
Griffin High School      1468
Wilson High School       2283
Cabrera High School      1858
Bailey High School       4976
Holden High School        427
Pena High School          962
Wright High School       1800
Rodriguez High School    3999
Johnson High School      4761
Ford High School         2739
Thomas High School       1635
Name: size, dtype: int64

In [31]:
# get total students per school from complete dataframe
per_school_counts = full_df["school_name"].value_counts()
per_school_counts

Bailey High School       4976
Johnson High School      4761
Hernandez High School    4635
Rodriguez High School    3999
Figueroa High School     2949
Huang High School        2917
Ford High School         2739
Wilson High School       2283
Cabrera High School      1858
Wright High School       1800
Shelton High School      1761
Thomas High School       1635
Griffin High School      1468
Pena High School          962
Holden High School        427
Name: school_name, dtype: int64

In [32]:
# get the budget of each school
per_school_budget = school_df.set_index("school_name")["budget"]
per_school_budget

school_name
Huang High School        1910635
Figueroa High School     1884411
Shelton High School      1056600
Hernandez High School    3022020
Griffin High School       917500
Wilson High School       1319574
Cabrera High School      1081356
Bailey High School       3124928
Holden High School        248087
Pena High School          585858
Wright High School       1049400
Rodriguez High School    2547363
Johnson High School      3094650
Ford High School         1763916
Thomas High School       1043130
Name: budget, dtype: int64

In [33]:
# calculate budget spent per student
per_student_budget = per_school_budget / per_school_counts
per_student_budget

Bailey High School       628.0
Cabrera High School      582.0
Figueroa High School     639.0
Ford High School         644.0
Griffin High School      625.0
Hernandez High School    652.0
Holden High School       581.0
Huang High School        655.0
Johnson High School      650.0
Pena High School         609.0
Rodriguez High School    637.0
Shelton High School      600.0
Thomas High School       638.0
Wilson High School       578.0
Wright High School       583.0
dtype: float64

In [34]:
# calculate mean test scores per school

per_school_math = full_df.groupby(["school_name"]).mean()["math_score"]
per_school_reading = full_df.groupby(["school_name"]).mean()["reading_score"]
per_school_math

school_name
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64

In [35]:
# get all passing scores for math and reading

per_school_passed_math = full_df[full_df["math_score"] >= 70]
per_school_passed_reading = full_df[full_df["reading_score"] >= 70]

In [36]:
# count the number of students who passed each topic

per_school_passed_math = per_school_passed_math.groupby("school_name").count()["student_name"]
per_school_passed_reading = per_school_passed_reading.groupby("school_name").count()["student_name"]

In [37]:
# calculate the percentage of students who passed each topic at each school

per_school_passed_math = per_school_passed_math / per_school_counts * 100
per_school_passed_reading = per_school_passed_reading / per_school_counts * 100

In [38]:
# count the number of students who passed both topics

per_school_passed_both = full_df[(full_df["math_score"] >= 70) & (full_df["reading_score"] >= 70)]
per_school_passed_both = per_school_passed_both.groupby("school_name").count()["student_name"]

In [39]:
# calculate the percentage of students who passed both topics

per_school_passed_both = per_school_passed_both / per_school_counts * 100
per_school_passed_both

Bailey High School       54.642283
Cabrera High School      91.334769
Figueroa High School     53.204476
Ford High School         54.289887
Griffin High School      90.599455
Hernandez High School    53.527508
Holden High School       89.227166
Huang High School        53.513884
Johnson High School      53.539172
Pena High School         90.540541
Rodriguez High School    52.988247
Shelton High School      89.892107
Thomas High School       90.948012
Wilson High School       90.582567
Wright High School       90.333333
dtype: float64

In [40]:
# create a summary dataframe

school_summary_df = pd.DataFrame({
    "School Type": school_types,
    "Total Students": per_school_counts,
    "Total School Budget": per_school_budget,
    "Per Student Budget": per_student_budget,
    "Average Math Score": per_school_math,
    "Average Reading Score": per_school_reading,
    "% Passing Math": per_school_passed_math,
    "% Passing Reading": per_school_passed_reading,
    "% Overall Passing": per_school_passed_both})

school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,3124928,628.0,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,1081356,582.0,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,1884411,639.0,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,1763916,644.0,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,917500,625.0,83.351499,83.816757,93.392371,97.138965,90.599455

In [41]:
# format columns

#school_summary_df["Total Students"] = school_summary_df["Total Students"].map("{:,}".format)

school_summary_df["Total School Budget"] = school_summary_df["Total School Budget"].map("${:,.2f}".format)

school_summary_df["Per Student Budget"] = school_summary_df["Per Student Budget"].map("${:,.2f}".format)

#school_summary_df["Average Math Score"] = school_summary_df["Average Math Score"].map("{:.1f}".format)

#school_summary_df["Average Reading Score"] = school_summary_df["Average Reading Score"].map("{:.1f}".format)

#school_summary_df["% Passing Math"] = school_summary_df["% Passing Math"].map("{:.1f}".format)

#school_summary_df["% Passing Reading"] = school_summary_df["% Passing Reading"].map("{:.1f}".format)

#school_summary_df["% Overall Passing"] = school_summary_df["% Overall Passing"].map("{:.1f}".format)


school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455

In [42]:
# reorder columns
new_column_order = ["School Type", "Total Students", "Total School Budget", "Per Student Budget", "Average Math Score", "Average Reading Score", "% Passing Math", "% Passing Reading", "% Overall Passing"]

school_summary_df = school_summary_df[new_column_order]

school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455

In [43]:
# sort and show top five schools.
top_schools = school_summary_df.sort_values(["% Overall Passing"], ascending=False)

top_schools.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769
Thomas High School,Charter,1635,"$1,043,130.00",$638.00,83.418349,83.848930,93.272171,97.308869,90.948012
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455
Wilson High School,Charter,2283,"$1,319,574.00",$578.00,83.274201,83.989488,93.867718,96.539641,90.582567
Pena High School,Charter,962,"$585,858.00",$609.00,83.839917,84.044699,94.594595,95.945946,90.540541

In [44]:
# sort and show bottom five schools.
bottom_schools = school_summary_df.sort_values(["% Overall Passing"], ascending=True)

bottom_schools.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Rodriguez High School,District,3999,"$2,547,363.00",$637.00,76.842711,80.744686,66.366592,80.220055,52.988247
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476
Huang High School,District,2917,"$1,910,635.00",$655.00,76.629414,81.182722,65.683922,81.316421,53.513884
Hernandez High School,District,4635,"$3,022,020.00",$652.00,77.289752,80.934412,66.752967,80.862999,53.527508
Johnson High School,District,4761,"$3,094,650.00",$650.00,77.072464,80.966394,66.057551,81.222432,53.539172

In [45]:
# new dataframes for each grade level

grade_9 = full_df[(full_df["grade"] == "9th")]
grade_10 = full_df[(full_df["grade"] == "10th")]
grade_11 = full_df[(full_df["grade"] == "11th")]
grade_12 = full_df[(full_df["grade"] == "12th")]

In [46]:
# average math scores per grade per school

grade_9_math = grade_9.groupby(["school_name"]).mean()["math_score"]

grade_10_math = grade_10.groupby(["school_name"]).mean()["math_score"]

grade_11_math = grade_11.groupby(["school_name"]).mean()["math_score"]

grade_12_math = grade_12.groupby(["school_name"]).mean()["math_score"]

grade_9_math

school_name
Bailey High School       77.083676
Cabrera High School      83.094697
Figueroa High School     76.403037
Ford High School         77.361345
Griffin High School      82.044010
Hernandez High School    77.438495
Holden High School       83.787402
Huang High School        77.027251
Johnson High School      77.187857
Pena High School         83.625455
Rodriguez High School    76.859966
Shelton High School      83.420755
Thomas High School       83.590022
Wilson High School       83.085578
Wright High School       83.264706
Name: math_score, dtype: float64

In [47]:
# average reading scores per grade per school

grade_9_reading = grade_9.groupby(["school_name"]).mean()["reading_score"]

grade_10_reading = grade_10.groupby(["school_name"]).mean()["reading_score"]

grade_11_reading = grade_11.groupby(["school_name"]).mean()["reading_score"]

grade_12_reading = grade_12.groupby(["school_name"]).mean()["reading_score"]

grade_9_reading

school_name
Bailey High School       81.303155
Cabrera High School      83.676136
Figueroa High School     81.198598
Ford High School         80.632653
Griffin High School      83.369193
Hernandez High School    80.866860
Holden High School       83.677165
Huang High School        81.290284
Johnson High School      81.260714
Pena High School         83.807273
Rodriguez High School    80.993127
Shelton High School      84.122642
Thomas High School       83.728850
Wilson High School       83.939778
Wright High School       83.833333
Name: reading_score, dtype: float64

In [48]:
# dataframe of average math scores by grade

math_scores_by_grade = pd.DataFrame({
               "9th": grade_9_math,
               "10th": grade_10_math,
               "11th": grade_11_math,
               "12th": grade_12_math})

math_scores_by_grade.head()

                            9th       10th       11th       12th
school_name
Bailey High School    77.083676  76.996772  77.515588  76.492218
Cabrera High School   83.094697  83.154506  82.765560  83.277487
Figueroa High School  76.403037  76.539974  76.884344  77.151369
Ford High School      77.361345  77.672316  76.918058  76.179963
Griffin High School   82.044010  84.229064  83.842105  83.356164

In [49]:
# dataframe of average reading scores by grade

reading_scores_by_grade = pd.DataFrame({
               "9th": grade_9_reading,
               "10th": grade_10_reading,
               "11th": grade_11_reading,
               "12th": grade_12_reading})

reading_scores_by_grade.head()

                            9th       10th       11th       12th
school_name
Bailey High School    81.303155  80.907183  80.945643  80.912451
Cabrera High School   83.676136  84.253219  83.788382  84.287958
Figueroa High School  81.198598  81.408912  80.640339  81.384863
Ford High School      80.632653  81.262712  80.403642  80.662338
Griffin High School   83.369193  83.706897  84.288089  84.013699

In [50]:
# format scores

math_scores_by_grade["9th"] = math_scores_by_grade["9th"].map("{:.1f}".format)
math_scores_by_grade["10th"] = math_scores_by_grade["10th"].map("{:.1f}".format)
math_scores_by_grade["11th"] = math_scores_by_grade["11th"].map("{:.1f}".format)
math_scores_by_grade["12th"] = math_scores_by_grade["12th"].map("{:.1f}".format)

reading_scores_by_grade["9th"] = reading_scores_by_grade["9th"].map("{:.1f}".format)
reading_scores_by_grade["10th"] = reading_scores_by_grade["10th"].map("{:.1f}".format)
reading_scores_by_grade["11th"] = reading_scores_by_grade["11th"].map("{:.1f}".format)
reading_scores_by_grade["12th"] = reading_scores_by_grade["12th"].map("{:.1f}".format)

In [51]:
# remove  index names
math_scores_by_grade.index.name = None
reading_scores_by_grade.index.name = None

math_scores_by_grade.head()

                       9th  10th  11th  12th
Bailey High School    77.1  77.0  77.5  76.5
Cabrera High School   83.1  83.2  82.8  83.3
Figueroa High School  76.4  76.5  76.9  77.2
Ford High School      77.4  77.7  76.9  76.2
Griffin High School   82.0  84.2  83.8  83.4

In [52]:
# descriptive stats for per-capita budget
per_student_budget.describe()

count     15.000000
mean     620.066667
std       28.544368
min      578.000000
25%      591.500000
50%      628.000000
75%      641.500000
max      655.000000
dtype: float64

In [53]:
# divide the per capita budget into bins
spending_bins = [0, 585, 615, 645, 675]
pd.cut(per_student_budget, spending_bins)

Bailey High School       (615, 645]
Cabrera High School        (0, 585]
Figueroa High School     (615, 645]
Ford High School         (615, 645]
Griffin High School      (615, 645]
Hernandez High School    (645, 675]
Holden High School         (0, 585]
Huang High School        (645, 675]
Johnson High School      (645, 675]
Pena High School         (585, 615]
Rodriguez High School    (615, 645]
Shelton High School      (585, 615]
Thomas High School       (615, 645]
Wilson High School         (0, 585]
Wright High School         (0, 585]
dtype: category
Categories (4, interval[int64, right]): [(0, 585] < (585, 615] < (615, 645] < (645, 675]]

In [54]:
# count the number of schools in each spending bin
spending_bins = [0, 585, 630, 645, 675]
per_student_budget.groupby(pd.cut(per_student_budget, spending_bins)).count()

(0, 585]      4
(585, 630]    4
(630, 645]    4
(645, 675]    3
dtype: int64

In [55]:
# group names corresponding to each bin
group_names = ["<$586", "$586-630", "$631-645", "$646-675"]

In [56]:
# designate the spending bin for each school
school_summary_df["Spending Range Per Student"] = pd.cut(per_student_budget, spending_bins, labels=group_names)
school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Spending Range Per Student
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283,$586-630
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769,<$586
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476,$631-645
Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887,$631-645
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455,$586-630

In [57]:
# calculate per-bin averages for test scores and passing rates

bin_math_scores = school_summary_df.groupby(["Spending Range Per Student"]).mean()["Average Math Score"]

bin_reading_scores = school_summary_df.groupby(["Spending Range Per Student"]).mean()["Average Reading Score"]

bin_math_passed = school_summary_df.groupby(["Spending Range Per Student"]).mean()["% Passing Math"]

bin_reading_passed = school_summary_df.groupby(["Spending Range Per Student"]).mean()["% Passing Reading"]

bin_both_passed = school_summary_df.groupby(["Spending Range Per Student"]).mean()["% Overall Passing"]

In [58]:
# assemble scores into a new dataframe

spending_summary_df = pd.DataFrame({
          "Average Math Score" : bin_math_scores,
          "Average Reading Score": bin_reading_scores,
          "% Passing Math": bin_math_passed,
          "% Passing Reading": bin_reading_passed,
          "% Overall Passing": bin_both_passed})

spending_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Spending Range Per Student,,,,,
<$586,83.455399,83.933814,93.460096,96.610877,90.369459
$586-630,81.899826,83.155286,87.133538,92.718205,81.418596
$631-645,78.518855,81.624473,73.484209,84.391793,62.857656
$646-675,76.997210,81.027843,66.164813,81.133951,53.526855

In [59]:
# format dataframe

spending_summary_df["Average Math Score"] = spending_summary_df["Average Math Score"].map("{:.1f}".format)

spending_summary_df["Average Reading Score"] = spending_summary_df["Average Reading Score"].map("{:.1f}".format)

spending_summary_df["% Passing Math"] = spending_summary_df["% Passing Math"].map("{:.0f}".format)

spending_summary_df["% Passing Reading"] = spending_summary_df["% Passing Reading"].map("{:.0f}".format)

spending_summary_df["% Overall Passing"] = spending_summary_df["% Overall Passing"].map("{:.0f}".format)

spending_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
Spending Range Per Student,,,,,
<$586,83.5,83.9,93,97,90
$586-630,81.9,83.2,87,93,81
$631-645,78.5,81.6,73,84,63
$646-675,77.0,81.0,66,81,54

In [60]:
# new bins for school size
size_bins = [0, 999, 1999, 5000]
group_names = ["Small (<1000)", "Medium (1000-1999)", "Large (2000-5000)"]

In [61]:
# estimate spending per bin
school_summary_df["School Size"] = pd.cut(school_summary_df["Total Students"], size_bins, labels = group_names)

school_summary_df.head()

,School Type,Total Students,Total School Budget,Per Student Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing,Spending Range Per Student,School Size
Bailey High School,District,4976,"$3,124,928.00",$628.00,77.048432,81.033963,66.680064,81.933280,54.642283,$586-630,Large (2000-5000)
Cabrera High School,Charter,1858,"$1,081,356.00",$582.00,83.061895,83.975780,94.133477,97.039828,91.334769,<$586,Medium (1000-1999)
Figueroa High School,District,2949,"$1,884,411.00",$639.00,76.711767,81.158020,65.988471,80.739234,53.204476,$631-645,Large (2000-5000)
Ford High School,District,2739,"$1,763,916.00",$644.00,77.102592,80.746258,68.309602,79.299014,54.289887,$631-645,Large (2000-5000)
Griffin High School,Charter,1468,"$917,500.00",$625.00,83.351499,83.816757,93.392371,97.138965,90.599455,$586-630,Medium (1000-1999)

In [62]:
# calculate mean scores by school size

size_math_scores = school_summary_df.groupby(["School Size"]).mean()["Average Math Score"]

size_reading_scores = school_summary_df.groupby(["School Size"]).mean()["Average Reading Score"]

size_math_passed = school_summary_df.groupby(["School Size"]).mean()["% Passing Math"]

size_reading_passed = school_summary_df.groupby(["School Size"]).mean()["% Passing Reading"]

size_both_passed = school_summary_df.groupby(["School Size"]).mean()["% Overall Passing"]

In [63]:
# new dataframe of per-size scores

size_summary_df = pd.DataFrame({
    "Average Math Score" : size_math_scores,
    "Average Reading Score" : size_reading_scores,
    "% Passing Math" : size_math_passed,
    "% Passing Reading" : size_reading_passed,
    "% Overall Passing" : size_both_passed})

size_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Size,,,,,
Small (<1000),83.821598,83.929843,93.550225,96.099437,89.883853
Medium (1000-1999),83.374684,83.864438,93.599695,96.790680,90.621535
Large (2000-5000),77.746417,81.344493,69.963361,82.766634,58.286003

In [64]:
# format the dataframe

size_summary_df["Average Math Score"] = size_summary_df["Average Math Score"].map("{:.1f}".format)

size_summary_df["Average Reading Score"] = size_summary_df["Average Reading Score"].map("{:.1f}".format)

size_summary_df["% Passing Math"] = size_summary_df["% Passing Math"].map("{:.0f}".format)

size_summary_df["% Passing Reading"] = size_summary_df["% Passing Reading"].map("{:.0f}".format)

size_summary_df["% Overall Passing"] = size_summary_df["% Overall Passing"].map("{:.0f}".format)

size_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Size,,,,,
Small (<1000),83.8,83.9,94,96,90
Medium (1000-1999),83.4,83.9,94,97,91
Large (2000-5000),77.7,81.3,70,83,58

In [69]:
# calculate mean scores by school type

type_math_scores = school_summary_df.groupby(["School Type"]).mean()["Average Math Score"]

type_reading_scores = school_summary_df.groupby(["School Type"]).mean()["Average Reading Score"]

type_math_passed = school_summary_df.groupby(["School Type"]).mean()["% Passing Math"]

type_reading_passed = school_summary_df.groupby(["School Type"]).mean()["% Passing Reading"]

type_both_passed = school_summary_df.groupby(["School Type"]).mean()["% Overall Passing"]

In [70]:
# new dataframe of per-type scores

type_summary_df = pd.DataFrame({
    "Average Math Score" : type_math_scores,
    "Average Reading Score" : type_reading_scores,
    "% Passing Math" : type_math_passed,
    "% Passing Reading" : type_reading_passed,
    "% Overall Passing" : type_both_passed})

type_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.473852,83.896421,93.620830,96.586489,90.432244
District,76.956733,80.966636,66.548453,80.799062,53.672208

In [71]:
# format the dataframe

type_summary_df["Average Math Score"] = type_summary_df["Average Math Score"].map("{:.1f}".format)

type_summary_df["Average Reading Score"] = type_summary_df["Average Reading Score"].map("{:.1f}".format)

type_summary_df["% Passing Math"] = type_summary_df["% Passing Math"].map("{:.0f}".format)

type_summary_df["% Passing Reading"] = type_summary_df["% Passing Reading"].map("{:.0f}".format)

type_summary_df["% Overall Passing"] = type_summary_df["% Overall Passing"].map("{:.0f}".format)

type_summary_df

,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
School Type,,,,,
Charter,83.5,83.9,94,97,90
District,77.0,81.0,67,81,54

In [68]:
math_scores_by_grade

                        9th  10th  11th  12th
Bailey High School     77.1  77.0  77.5  76.5
Cabrera High School    83.1  83.2  82.8  83.3
Figueroa High School   76.4  76.5  76.9  77.2
Ford High School       77.4  77.7  76.9  76.2
Griffin High School    82.0  84.2  83.8  83.4
Hernandez High School  77.4  77.3  77.1  77.2
Holden High School     83.8  83.4  85.0  82.9
Huang High School      77.0  75.9  76.4  77.2
Johnson High School    77.2  76.7  77.5  76.9
Pena High School       83.6  83.4  84.3  84.1
Rodriguez High School  76.9  76.6  76.4  77.7
Shelton High School    83.4  82.9  83.4  83.8
Thomas High School     83.6  83.1  83.5  83.5
Wilson High School     83.1  83.7  83.2  83.0
Wright High School     83.3  84.0  83.8  83.6